app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `contacts`
WHERE `status` = 'unread'
---
    public function notifications()
    {
        return $this->response->setJSON([
            'orders' => $this->orderModel
                ->whereIn('status', ['pending', 'processing'])
                ->countAllResults(),

            'messages' => $this->contactModel
                ->where('status', 'unread')
                ->countAllResults()