app/Controllers/BaseController.php

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` IN ('pending','processing')
---
        $contactModel = new ContactModel();

        // GLOBAL ADMIN NOTIFICATION DATA
        $this->data['new_orders'] = $orderModel
            ->whereIn('status', ['pending', 'processing'])
            ->countAllResults();